# 18:30

# 1) Написать программу, которая выводит на экран текст
print('Книги обладают способностью бессмертия. Они самые долговечные плоды человеческой деятельности')

# 2) Вычислить значение следующего выражения
from math import cos, pi

x = 2

a = 3/8 * pi - x/4
b = 11/8 * pi + x/4
y = cos(a) ** 2 + cos(b) ** 2

print('y =', y)

